# Summarizing & Computing Descriptive Statistics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(
    [[2.4,np.nan],[6.3,-5.4],
     [np.nan,np.nan],[0.75,-1.3]],
    index=["a","b","c","d"],
    columns=["one","two"])
df

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [3]:
df.sum()

one    9.45
two   -6.70
dtype: float64

In [4]:
df.sum(axis=1)

a    2.40
b    0.90
c    0.00
d   -0.55
dtype: float64

In [5]:
df.mean(axis=1)

a    2.400
b    0.450
c      NaN
d   -0.275
dtype: float64

In [6]:
df.mean(axis=1,skipna=False)

a      NaN
b    0.450
c      NaN
d   -0.275
dtype: float64

In [7]:
df.idxmax()

one    b
two    d
dtype: object

In [8]:
df.idxmin()

one    d
two    b
dtype: object

In [9]:
df.cumsum()

    one  two
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [10]:
df.describe()

         one       two
count  3.000  2.000000
mean   3.150 -3.350000
std    2.850  2.899138
min    0.750 -5.400000
25%    1.575 -4.375000
50%    2.400 -3.350000
75%    4.350 -2.325000
max    6.300 -1.300000

In [15]:
df=pd.read_csv(r'C:\Users\Lenovo\Downloads\ODI_DATASET.csv', 
                 sep=",",
                 header=None)

In [21]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,NaN,Score,Overs,RPO,Target,Inns,Result,Opposition,Ground,Start Date,Match_ID,Country,Country_ID
1,412.0,250,48.3,5.15,NaN,1,won,v India,Kolkata,3 Jan 2013,ODI # 3315,Pakistan,7
2,680.0,165,48.0,3.43,251,2,lost,v Pakistan,Kolkata,3 Jan 2013,ODI # 3315,India,6
3,413.0,157,48.5,3.21,168,2,lost,v India,Delhi,6 Jan 2013,ODI # 3316,Pakistan,7
4,681.0,167,43.4,3.82,NaN,1,won,v Pakistan,Delhi,6 Jan 2013,ODI # 3316,India,6

In [36]:
df.columns=['NaN','Score','Overs','RPO','Target','Inns',
             'Result','Opposition',
             'Ground','Start Date','Match_ID','Country','Country_ID']

In [33]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,NaN,Score,Overs,RPO,Target,Inns,Result,Opposition,Ground,Start Date,Match_ID,Country,Country_ID
1,412.0,250,48.3,5.15,NaN,1,won,v India,Kolkata,3 Jan 2013,ODI # 3315,Pakistan,7
2,680.0,165,48.0,3.43,251,2,lost,v Pakistan,Kolkata,3 Jan 2013,ODI # 3315,India,6
3,413.0,157,48.5,3.21,168,2,lost,v India,Delhi,6 Jan 2013,ODI # 3316,Pakistan,7
4,681.0,167,43.4,3.82,NaN,1,won,v Pakistan,Delhi,6 Jan 2013,ODI # 3316,India,6

In [47]:
df.corr()

     NaN
NaN  1.0

In [48]:
df.cov()

          NaN
NaN  140076.0

In [51]:
s=pd.Series(["b","b","b","b","c",
             "c","a","a","a"])
s

0    b
1    b
2    b
3    b
4    c
5    c
6    a
7    a
8    a
dtype: object

In [52]:
s.unique()

array(['b', 'c', 'a'], dtype=object)

In [53]:
s.value_counts()

b    4
a    3
c    2
dtype: int64

In [55]:
x=s.isin(["b","c"])
x

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [56]:
s[x]

0    b
1    b
2    b
3    b
4    c
5    c
dtype: object